---
kind: property
id: P:Autodesk.Revit.DB.FillPattern.StrokesPerArea
source: html/610876a6-2542-acde-7cfc-8f50e231c213.htm
---
# Autodesk.Revit.DB.FillPattern.StrokesPerArea Property

Gets the number of strokes that placed on unit area.

## Syntax (C#)
```csharp
public double StrokesPerArea { get; }
```